---
kind: enumMember
id: F:Autodesk.Revit.DB.Architecture.StairsSupportTopsideSurfaceType.Open
enum: Autodesk.Revit.DB.Architecture.StairsSupportTopsideSurfaceType
source: html/ec20378c-a6ea-339e-d442-cff669c7343e.htm
---
# Autodesk.Revit.DB.Architecture.StairsSupportTopsideSurfaceType.Open

The style of the topside surface of the support is open.